sugikazu75/spinal_kondo/kondo_servo.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32H7
RCC.DIVQ2Freq_Value=129000000
ProjectManager.MainLocation=Core/Src
ProjectManager.ProjectFileName=kondo_servo.ioc
RCC.SAI1Freq_Value=129000000
RCC.CortexFreq_Value=64000000
UART4.IPParameters=BaudRate
ProjectManager.KeepUserCode=true
Mcu.PinsNb=6
Mcu.UserName=STM32H743VITx
UART8.IPParameters=BaudRate
ProjectManager.NoMain=false
RCC.SWPMI1Freq_Value=64000000
PE1.Mode=Half_duplex(single_wire_mode)
RCC.SAI4BFreq_Value=129000000
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_UART4_Init-UART4-false-HAL-true,4-MX_UART5_Init-UART5-false-HAL-true,5-MX_UART7_Init-UART7-false-HAL-true,6-MX_UART8_Init-UART8-false-HAL-true,0-MX_CORTEX_M7_Init-CORTEX_M7-false-HAL-true
RCC.RTCFreq_Value=32000
ProjectManager.DefaultFWLocation=true
RCC.CpuClockFreq_Value=64000000
RCC.VCO2OutputFreq_Value=258000000
ProjectManager.DeletePrevious=true
RCC.QSPIFreq_Value=64000000
PB13.Signal=UART5_TX
PinOutPanel.RotationAngle=0
RCC.FamilyName=M
RCC.MCO1PinFreq_Value=64000000
ProjectManager.StackSize=0x400
RCC.AHB4Freq_Value=64000000
RCC.VCOInput3Freq_Value=2000000
RCC.SPI6Freq_Value=64000000
PE8.Mode=Half_duplex(single_wire_mode)
RCC.D1CPREFreq_Value=64000000
RCC.LPTIM1Freq_Value=64000000
Mcu.IP4=UART4
Mcu.IP5=UART5
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP2=RCC
RCC.USART234578Freq_Value=64000000
Mcu.IP3=SYS
Mcu.IP0=CORTEX_M7
Mcu.IP1=NVIC
RCC.SPI45Freq_Value=64000000
RCC.Tim1OutputFreq_Value=64000000
RCC.SPI123Freq_Value=129000000
Mcu.UserConstants=
ProjectManager.TargetToolchain=STM32CubeIDE
RCC.DIVP3Freq_Value=129000000
RCC.SDMMCFreq_Value=129000000
RCC.VCO1OutputFreq_Value=258000000
Mcu.ThirdPartyNb=0
UART4.BaudRate=1250000
RCC.HCLKFreq_Value=64000000
RCC.I2C4Freq_Value=64000000
Mcu.IPNb=8
ProjectManager.PreviousToolchain=
RCC.AXIClockFreq_Value=64000000
RCC.SPDIFRXFreq_Value=129000000
RCC.DIVQ3Freq_Value=129000000
PE2.GPIOParameters=GPIO_Label
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=129000000
PE1.Signal=UART8_TX
RCC.CKPERFreq_Value=64000000
Mcu.Pin0=PE2
Mcu.Pin1=PA0
Mcu.Pin2=PE8
RCC.HRTIMFreq_Value=64000000
Mcu.Pin3=PB13
Mcu.Pin4=PE1
Mcu.Pin5=VP_SYS_VS_Systick
ProjectManager.ProjectBuild=false
RCC.DIVR3Freq_Value=129000000
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA0.Locked=true
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
board=custom
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
ProjectManager.LastFirmware=true
RCC.VCOInput1Freq_Value=2000000
ProjectManager.FirmwarePackage=STM32Cube FW_H7 V1.9.1
MxDb.Version=DB.6.0.21
RCC.AHB12Freq_Value=64000000
RCC.APB2Freq_Value=64000000
RCC.DIVP1Freq_Value=129000000
ProjectManager.BackupPrevious=false
RCC.FMCFreq_Value=64000000
MxCube.Version=6.2.1
PE8.Signal=UART7_TX
RCC.FDCANFreq_Value=129000000
RCC.RNGFreq_Value=48000000
RCC.ADCFreq_Value=129000000
RCC.USART16Freq_Value=64000000
File.Version=6
VP_SYS_VS_Systick.Mode=SysTick
PA0.Mode=Half_duplex(single_wire_mode)
PE2.Signal=GPIO_Output
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.FreePins=false
RCC.DIVR2Freq_Value=129000000
RCC.IPParameters=ADCFreq_Value,AHB12Freq_Value,AHB4Freq_Value,APB1Freq_Value,APB2Freq_Value,APB3Freq_Value,APB4Freq_Value,AXIClockFreq_Value,CECFreq_Value,CKPERFreq_Value,CortexFreq_Value,CpuClockFreq_Value,D1CPREFreq_Value,DFSDMACLkFreq_Value,DFSDMFreq_Value,DIVP1Freq_Value,DIVP2Freq_Value,DIVP3Freq_Value,DIVQ1Freq_Value,DIVQ2Freq_Value,DIVQ3Freq_Value,DIVR1Freq_Value,DIVR2Freq_Value,DIVR3Freq_Value,FDCANFreq_Value,FMCFreq_Value,FamilyName,HCLK3ClockFreq_Value,HCLKFreq_Value,HRTIMFreq_Value,I2C123Freq_Value,I2C4Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPTIM345Freq_Value,LPUART1Freq_Value,LTDCFreq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,QSPIFreq_Value,RNGFreq_Value,RTCFreq_Value,SAI1Freq_Value,SAI23Freq_Value,SAI4AFreq_Value,SAI4BFreq_Value,SDMMCFreq_Value,SPDIFRXFreq_Value,SPI123Freq_Value,SPI45Freq_Value,SPI6Freq_Value,SWPMI1Freq_Value,SYSCLKFreq_VALUE,Tim1OutputFreq_Value,Tim2OutputFreq_Value,TraceFreq_Value,USART16Freq_Value,USART234578Freq_Value,USBFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32H743VITx
RCC.LPTIM2Freq_Value=64000000
ProjectManager.HalAssertFull=false
RCC.DIVP2Freq_Value=129000000
ProjectManager.ProjectName=kondo_servo
ProjectManager.UnderRoot=true
PA0.Signal=UART4_TX
RCC.APB3Freq_Value=64000000
Mcu.IP6=UART7
Mcu.IP7=UART8
ProjectManager.CoupleFile=false
RCC.MCO2PinFreq_Value=64000000
RCC.SYSCLKFreq_VALUE=64000000
Mcu.Package=LQFP100
RCC.I2C123Freq_Value=64000000
UART8.BaudRate=1250000
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.CompilerOptimize=6
ProjectManager.ToolChainLocation=
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
ProjectManager.HeapSize=0x200
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
UART5.IPParameters=BaudRate
RCC.DFSDMFreq_Value=64000000
RCC.DIVR1Freq_Value=129000000
UART7.IPParameters=BaudRate
RCC.LPTIM345Freq_Value=64000000
UART7.BaudRate=1250000
ProjectManager.ComputerToolchain=false
RCC.LTDCFreq_Value=129000000
RCC.SAI4AFreq_Value=129000000
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
RCC.TraceFreq_Value=64000000
RCC.APB4Freq_Value=64000000
RCC.CECFreq_Value=32000
RCC.SAI23Freq_Value=129000000
RCC.DIVQ1Freq_Value=129000000
PE2.Locked=true
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.LPUART1Freq_Value=64000000
UART5.BaudRate=1250000
PB13.Mode=Half_duplex(single_wire_mode)
RCC.HCLK3ClockFreq_Value=64000000
RCC.VCOInput2Freq_Value=2000000
RCC.APB1Freq_Value=64000000
PE2.GPIO_Label=LED0
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DeviceId=STM32H743VITx
RCC.Tim2OutputFreq_Value=64000000
ProjectManager.LibraryCopy=1
RCC.DFSDMACLkFreq_Value=129000000
RCC.VCO3OutputFreq_Value=258000000
isbadioc=false
